In [25]:
#importaciones

import pandas as pd

pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [26]:
df_exploracion = pd.read_csv('../files/HR_RAW_DATA.csv', index_col=0)

In [27]:
df_exploracion.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [58]:
columnas = df_exploracion.columns
print(columnas)

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'employeecount',
       'employeenumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NUMCOMPANIESWORKED',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TOTALWORKINGYEARS', 'TrainingTimesLastYear', 'WORKLIFEBALANCE',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YEARSWITHCURRMANAGER', 'SameAsMonthlyIncome', 'DateBirth', 'Salary',
       'RoleDepartament', 'NUMBERCHILDREN', 'RemoteWork'],
      dtype='object')

In [29]:
lista_columnas_explorar = ['Age', 'Gender','MaritalStatus', 'NUMBERCHILDREN','DateBirth', 'Over18', 'Education','EducationField', 'NUMCOMPANIESWORKED', 'TOTALWORKINGYEARS']

In [13]:
for columna in lista_columnas_explorar:
    print(columna.upper())
    #print(df_exploracion[columna].dtypes())
    print(df_exploracion[columna].unique())
    print(df_exploracion[columna].value_counts())
    print(df_exploracion[columna].isnull())
    print(df_exploracion[columna].isnull().sum())
    print(df_exploracion[columna].duplicated())
    print(df_exploracion[columna].duplicated().sum())
    print( "-------------------------------------")

AGE
['51' '52' '42' '47' '46' '48' '59' '41' '56' '38' '55' '40' '58' '35'
 '45' '33' '36' '34' 'forty-seven' '53' '43' '60' '32' '37' '49' '39' '50'
 '44' '30' 'fifty-eight' '29' '31' '54' '57' '27' 'thirty-six' '28' '26'
 'fifty-five' '25' 'fifty-two' 'thirty-one' '24' 'thirty' '23' '22' '21'
 '20' 'twenty-six' '19' 'thirty-seven' '18' 'thirty-two' 'twenty-four']
35              84
34              83
31              82
29              78
36              74
32              64
38              64
30              63
33              61
40              60
27              54
37              53
28              53
42              50
45              48
41              46
26              45
39              45
43              40
46              38
44              34
50              31
25              27
24              26
47              26
49              25
55              24
54              20
51              20
53              20
48              20
52              18
56              17
21              16
22              16
23              15
58              14
20              11
59              10
19               9
18               8
60               5
57               5
thirty-two       2
fifty-eight      1
twenty-six       1
thirty-seven     1
thirty-one       1
thirty           1
fifty-two        1
fifty-five       1
thirty-six       1
forty-seven      1
twenty-four      1
Name: Age, dtype: int64
0       False
1       False
2       False
3       False
4       False
        ...
1609    False
1610    False
1611    False
1612    False
1613    False
Name: Age, Length: 1614, dtype: bool
0
0       False
1       False
2       False
3       False
4       False
        ...
1609     True
1610     True
1611     True
1612     True
1613     True
Name: Age, Length: 1614, dtype: bool
1560
-------------------------------------
GENDER
[0 1]
0    971
1    643
Name: Gender, dtype: int64
0       False
1       False
2       False
3       False
4       False
        ...
1609    False
1610    False
1611    False
1612    False
1613    False
Name: Gender, Length: 1614, dtype: bool
0
0       False
1        True
2        True
3       False
4        True
        ...
1609     True
1610     True
1611     True
1612     True
1613     True
Name: Gender, Length: 1614, dtype: bool
1612
-------------------------------------
MARITALSTATUS
[nan 'Married' 'Divorced' 'Single' 'divorced' 'Marreid']
Married     404
Single      325
Divorced    188
Marreid      35
divorced     11
Name: MaritalStatus, dtype: int64
0        True
1        True
2       False
3       False
4       False
        ...
1609    False
1610     True
1611    False
1612    False
1613     True
Name: MaritalStatus, Length: 1614, dtype: bool
651
0       False
1        True
2       False
3        True
4       False
        ...
1609     True
1610     True
1611     True
1612     True
1613     True
Name: MaritalStatus, Length: 1614, dtype: bool
1608
-------------------------------------
NUMBERCHILDREN
[nan]
Series([], Name: NUMBERCHILDREN, dtype: int64)
0       True
1       True
2       True
3       True
4       True
        ...
1609    True
1610    True
1611    True
1612    True
1613    True
Name: NUMBERCHILDREN, Length: 1614, dtype: bool
1614
0       False
1        True
2        True
3        True
4        True
        ...
1609     True
1610     True
1611     True
1612     True
1613     True
Name: NUMBERCHILDREN, Length: 1614, dtype: bool
1613
-------------------------------------
DATEBIRTH
[1972 1971 1981 1976 1977 1975 1964 1982 1967 1985 1968 1983 1965 1988
 1978 1990 1987 1989 1970 1980 1963 1991 1986 1974 1984 1973 1979 1993
 1994 1992 1969 1966 1996 1995 1997 1998 1999 2000 2001 2002 2003 2004
 2005]
1988    84
1992    83
1989    83
1994    78
1987    75
1991    65
1985    64
1993    64
1990    61
1983    60
1986    55
1996    54
1995    53
1981    50
1978    48
1982    46
1997    46
1984    45
1980    40
1977    38
1979    34
1973    31
1999    27
1976    27
1998    27
1968    25
1974    25
1969    20
1972    20
1970    20
1975    20
1971    19
1967    17
2001    16
2002    16
1965    15
2000    15
2003    11
1964    10
2004     9
2005     8
1963     5
1966     5
Name: DateBirth, dtype: int64
0       False
1       False
2       False
3       False
4       False
        ...
1609    False
1610    False
1611    False
1612    False
1613    False
Name: DateBirth, Length: 1614, dtype: bool
0
0       False
1       False
2       False
3       False
4       False
        ...
1609     True
1610     True
1611     True
1612     True
1613     True
Name: DateBirth, Length: 1614, dtype: bool
1571
-------------------------------------
OVER18
['Y' nan]
Y    713
Name: Over18, dtype: int64
0       False
1        True
2        True
3       False
4       False
        ...
1609    False
1610     True
1611     True
1612     True
1613    False
Name: Over18, Length: 1614, dtype: bool
901
0       False
1       False
2        True
3        True
4        True
        ...
1609     True
1610     True
1611     True
1612     True
1613     True
Name: Over18, Length: 1614, dtype: bool
1612
-------------------------------------
EDUCATION
[3 4 2 1 5]
3    621
4    445
2    314
1    180
5     54
Name: Education, dtype: int64
0       False
1       False
2       False
3       False
4       False
        ...
1609    False
1610    False
1611    False
1612    False
1613    False
Name: Education, Length: 1614, dtype: bool
0
0       False
1       False
2       False
3        True
4        True
        ...
1609     True
1610     True
1611     True
1612     True
1613     True
Name: Education, Length: 1614, dtype: bool
1609
-------------------------------------
EDUCATIONFIELD
[nan 'Life Sciences' 'Technical Degree' 'Medical' 'Other' 'Marketing'
 'Human Resources']
Life Sciences       349
Medical             276
Marketing           104
Technical Degree     69
Other                59
Human Resources      12
Name: EducationField, dtype: int64
0        True
1       False
2       False
3       False
4       False
        ...
1609    False
1610     True
1611     True
1612    False
1613    False
Name: EducationField, Length: 1614, dtype: bool
745
0       False
1       False
2       False
3       False
4        True
        ...
1609     True
1610     True
1611     True
1612     True
1613     True
Name: EducationField, Length: 1614, dtype: bool
1607
-------------------------------------
NUMCOMPANIESWORKED
[7 0 1 3 2 4 8 9 5 6]
1    573
0    226
3    169
4    157
2    156
7     84
6     73
5     66
9     59
8     51
Name: NUMCOMPANIESWORKED, dtype: int64
0       False
1       False
2       False
3       False
4       False
        ...
1609    False
1610    False
1611    False
1612    False
1613    False
Name: NUMCOMPANIESWORKED, Length: 1614, dtype: bool
0
0       False
1       False
2       False
3       False
4       False
        ...
1609     True
1610     True
1611     True
1612     True
1613     True
Name: NUMCOMPANIESWORKED, Length: 1614, dtype: bool
1604
-------------------------------------
TOTALWORKINGYEARS
[nan '34,0' '22,0' '28,0' '20,0' '21,0' '33,0' '40,0' '18,0' '25,0' '15,0'
 '17,0' '26,0' '16,0' '24,0' '14,0' '23,0' '27,0' '19,0' '11,0' '38,0'
 '37,0' '13,0' '12,0' '29,0' '10,0' '36,0' '35,0' '9,0' '31,0' '32,0'
 '8,0' '7,0' '30,0' '6,0' '5,0' '4,0' '3,0' '2,0' '1,0' '0,0']
10,0    144
8,0      86
6,0      84
9,0      69
5,0      66
7,0      56
4,0      54
1,0      53
12,0     34
3,0      32
14,0     30
13,0     30
11,0     29
15,0     28
16,0     28
20,0     28
18,0     27
21,0     23
17,0     22
2,0      21
22,0     18
19,0     17
24,0     14
23,0     13
28,0     13
26,0      8
0,0       8
29,0      6
36,0      6
25,0      6
33,0      6
37,0      5
27,0      5
31,0      4
30,0      3
32,0      3
35,0      3
40,0      3
34,0      2
38,0      1
Name: TOTALWORKINGYEARS, dtype: int64
0        True
1       False
2       False
3        True
4        True
        ...
1609     True
1610     True
1611    False
1612    False
1613     True
Name: TOTALWORKINGYEARS, Length: 1614, dtype: bool
526
0       False
1       False
2       False
3        True
4        True
        ...
1609     True
1610     True
1611     True
1612     True
1613     True
Name: TOTALWORKINGYEARS, Length: 1614, dtype: bool
1573
-------------------------------------

In [16]:
df_exploracion.loc[:,lista_columnas_explorar]

,Age,Gender,MaritalStatus,NUMBERCHILDREN,DateBirth,Over18,Education,EducationField,NUMCOMPANIESWORKED,TOTALWORKINGYEARS
0,51,0,NaN,NaN,1972,Y,3,NaN,7,NaN
1,52,0,NaN,NaN,1971,NaN,4,Life Sciences,0,"34,0"
2,42,0,Married,NaN,1981,NaN,2,Technical Degree,1,"22,0"
3,47,1,Married,NaN,1976,Y,4,Medical,3,NaN
4,46,1,Divorced,NaN,1977,Y,3,Technical Degree,2,NaN
...,...,...,...,...,...,...,...,...,...,...
1609,36,0,Married,NaN,1987,Y,1,Life Sciences,1,NaN
1610,45,0,NaN,NaN,1978,NaN,2,NaN,1,NaN
1611,39,0,Single,NaN,1984,NaN,5,NaN,0,"9,0"
1612,36,0,Divorced,NaN,1987,NaN,4,Technical Degree,4,"12,0"
1613,46,0,NaN,NaN,1977,Y,2,Medical,6,NaN

In [26]:
#columna Age
df_exploracion["Age"].describe().T
#df_exploracion["Age"].value_counts()
#df_exploracion["Age"].isnull().sum()
#df_exploracion["Age"].dtype
#df_exploracion["Age"].duplicated().sum()

#aparecen mezcladas en número y letra, unificarlos

count     1614
unique      54
top         35
freq        84
Name: Age, dtype: object

In [3]:
df_exploracion["Age"].unique()

array(['51', '52', '42', '47', '46', '48', '59', '41', '56', '38', '55',
       '40', '58', '35', '45', '33', '36', '34', 'forty-seven', '53',
       '43', '60', '32', '37', '49', '39', '50', '44', '30',
       'fifty-eight', '29', '31', '54', '57', '27', 'thirty-six', '28',
       '26', 'fifty-five', '25', 'fifty-two', 'thirty-one', '24',
       'thirty', '23', '22', '21', '20', 'twenty-six', '19',
       'thirty-seven', '18', 'thirty-two', 'twenty-four'], dtype=object)

In [ ]:
df_exploracion["Age"].isnull().sum()

In [12]:

diccionario_edades = {
    'forty-seven':47,
    'fifty-eight': 58,
    'thirty-six': 36,
    'fifty-five': 55, 
    'fifty-two': 52,
    'thirty-one': 31,
    'thirty': 30,
    'twenty-six': 26, 
    'thirty-seven' : 37, 
    'thirty-two': 32,
    'twenty-four' : 24
    }                   

df_exploracion["Age"] = df_exploracion["Age"].replace(diccionario_edades)
df_exploracion["Age"].unique()
# convertir a integrer

array(['51', '52', '42', '47', '46', '48', '59', '41', '56', '38', '55',
       '40', '58', '35', '45', '33', '36', '34', 47, '53', '43', '60',
       '32', '37', '49', '39', '50', '44', '30', 58, '29', '31', '54',
       '57', '27', 36, '28', '26', 55, '25', 52, 31, '24', 30, '23', '22',
       '21', '20', 26, '19', 37, '18', 32, 24], dtype=object)

In [30]:
#Columna 'Gender'
df_exploracion["Gender"].unique()

array([0, 1])

In [19]:
df_exploracion["Gender"].value_counts()

Series([], Name: Gender, dtype: int64)

In [31]:
df_exploracion["Gender"].isnull().sum()

#los datos aparecen como correctos, pero unificar que aparezcan igual, 
# se cambian a 0 : hombre, 1 : mujer

0

In [31]:
print(df_exploracion["Gender"])

0       0
1       0
2       0
3       1
4       1
       ..
1609    0
1610    0
1611    0
1612    0
1613    0
Name: Gender, Length: 1614, dtype: int64

In [55]:
#.replace para sustituir 0 / 1 por Male / Female

df_exploracion["Gender"].replace(to_replace=[0,1],value= ["Male","Female"],inplace=True)
df_exploracion["Gender"]

0         Male
1         Male
2         Male
3       Female
4       Female
         ...
1609      Male
1610      Male
1611      Male
1612      Male
1613      Male
Name: Gender, Length: 1614, dtype: object

In [33]:
df_exploracion['MaritalStatus'].unique()

array([nan, 'Married', 'Divorced', 'Single', 'divorced', 'Marreid'],
      dtype=object)

In [35]:
df_exploracion['MaritalStatus'].isnull().sum()

651

In [56]:
df_exploracion['MaritalStatus'].replace(to_replace=['Marreid','divorced'],value= ['Married','Divorced'],inplace=True)

In [57]:
df_exploracion['MaritalStatus'].unique()

array([nan, 'Married', 'Divorced', 'Single'], dtype=object)

In [37]:
df_exploracion['NUMBERCHILDREN']

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
        ..
1609   NaN
1610   NaN
1611   NaN
1612   NaN
1613   NaN
Name: NUMBERCHILDREN, Length: 1614, dtype: float64

In [39]:
df_exploracion['NUMBERCHILDREN'].unique()
df_exploracion['NUMBERCHILDREN'].value_counts()

Series([], Name: NUMBERCHILDREN, dtype: int64)

In [7]:
df_exploracion["DateBirth"].unique()

# convertir a integrer

array([1972, 1971, 1981, 1976, 1977, 1975, 1964, 1982, 1967, 1985, 1968,
       1983, 1965, 1988, 1978, 1990, 1987, 1989, 1970, 1980, 1963, 1991,
       1986, 1974, 1984, 1973, 1979, 1993, 1994, 1992, 1969, 1966, 1996,
       1995, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005])

In [8]:
df_exploracion["DateBirth"].describe().T

count    1614.000000
mean     1986.076208
std         9.101332
min      1963.000000
25%      1980.000000
50%      1987.000000
75%      1993.000000
max      2005.000000
Name: DateBirth, dtype: float64

In [11]:
df_exploracion["DateBirth"].isnull().sum()

0

In [13]:
df_exploracion['Over18']
df_exploracion['Over18'].unique()

array(['Y', nan], dtype=object)

In [14]:
df_exploracion['Over18'].isnull().sum()

901

In [17]:
#'Education'
df_exploracion['Education'].unique()

array([3, 4, 2, 1, 5])

In [19]:
df_exploracion['Education'].value_counts()

3    621
4    445
2    314
1    180
5     54
Name: Education, dtype: int64

In [21]:
df_exploracion['Education'].isnull().sum()

0

In [22]:
#'EducationField'
df_exploracion['EducationField'].unique()

array([nan, 'Life Sciences', 'Technical Degree', 'Medical', 'Other',
       'Marketing', 'Human Resources'], dtype=object)

In [23]:
df_exploracion['EducationField'].value_counts()

Life Sciences       349
Medical             276
Marketing           104
Technical Degree     69
Other                59
Human Resources      12
Name: EducationField, dtype: int64

In [25]:
df_exploracion['EducationField'].isnull().sum()

745

In [59]:
df_exploracion['EducationField']

0                    NaN
1          Life Sciences
2       Technical Degree
3                Medical
4       Technical Degree
              ...
1609       Life Sciences
1610                 NaN
1611                 NaN
1612    Technical Degree
1613             Medical
Name: EducationField, Length: 1614, dtype: object

In [28]:
#'NUMCOMPANIESWORKED'
df_exploracion['NUMCOMPANIESWORKED'].isnull().sum()

0

In [29]:
df_exploracion['NUMCOMPANIESWORKED'].value_counts()

1    573
0    226
3    169
4    157
2    156
7     84
6     73
5     66
9     59
8     51
Name: NUMCOMPANIESWORKED, dtype: int64

In [35]:
#TOTALWORKINGYEARS
df_exploracion['TOTALWORKINGYEARS'].unique()

# transformar en integrer
#hay que utilizar  I mayúscula

array([nan, '34,0', '22,0', '28,0', '20,0', '21,0', '33,0', '40,0',
       '18,0', '25,0', '15,0', '17,0', '26,0', '16,0', '24,0', '14,0',
       '23,0', '27,0', '19,0', '11,0', '38,0', '37,0', '13,0', '12,0',
       '29,0', '10,0', '36,0', '35,0', '9,0', '31,0', '32,0', '8,0',
       '7,0', '30,0', '6,0', '5,0', '4,0', '3,0', '2,0', '1,0', '0,0'],
      dtype=object)

In [36]:
df_exploracion['TOTALWORKINGYEARS'].isnull().sum()

526